CREATE database Бібліотека;
use Бібліотека;
CREATE TABLE Книжка(
Назва_книги VARCHAR(120) NOT NULL,
Опис VARCHAR(15) DEFAULT 'Опис_відсутній',
Дата_публікації date DEFAULT '2018-01-01',
Автор VARCHAR(60) NOT NULL,
Категорія VARCHAR(30) NOT NULL
);
INSERT INTO Книжка(Назва_книги, Автор, Категорія)
VALUES ('Алхімік', 'Пауло Коельйо', 'Роман'),
('Вбити пересмішника','Харпер Лі','Роман'),
('1984','Джордж Орвелл','Роман'),
('Ловець у житі','Джером Селінджер','Роман'),
('Великий Ґетсбі','Френсіс Скотт','Роман'),
('Гаррі Поттер і філософський камінь','Джоан Роулінг','Роман'),
('Маленький принц','Антуан де Сент-Екзюпері','Казка'),
('451° за Фаренгейтом','Рей Бредбері','Роман'),
('Бойня номер п’ять','Курт Воннеґут','Роман'),
('Над зозулиним гніздом','Кен Кізі','Роман');
select * from Книжка;
drop database бібліотека;