create database бібліотека;
use бібліотека;
create table книжка (
id int primary key not null auto_increment,
назва_книги varchar(120) not null,
опис varchar(200),
дата_публікації date not null default '2018-01-01',
категорія varchar(30) not null, 
isbn varchar(20) not null unique,
кількість_сторінок int not null,
імя_автора varchar(45) not null,
прізвище_автора varchar(45) not null,
email_автора varchar(50) not null unique,
вік_автора int not null,
дата_народження date not null,
нагороди_автора varchar(120) null
);

insert into книжка (назва_книги, опис, категорія, isbn, кількість_сторінок, імя_автора, 
прізвище_автора, email_автора, вік_автора, дата_народження, нагороди_автора)
 values ('Hi-Fi', 'смішна та сумна, легка і часом глибокодумна, зворушлива та подекуди цинічна історія кохання',
 'роман', '9780575057487', 304, 'Нік', 'Хорнбі', 'nik@gmail.com', 64, '1957-04-17', 'премія Е. М. Форстера'),
 ('П`ята дитина', 'роман про виховання складної дитини', 'роман', '9780224025539', 256, 'Доріс Мей', 'Лессінґ',
 'lessing@gmail.com', 94, '1919-10-22', 'удостоєна Ордену кавалерів пошани, Британська премія Сомерсета Моема, Нобелівська премія з літератури'),
 ('Щоденник Бріджит Джонс', 'написаний у формі особистого щоденника самотньої жінки, яка працює в Лондоні', 'роман',
 '9780333906873', 365, 'Хелен', 'Філдінг', 'helen@gmail.com', 63, '1958-02-19', 'Британська книга року,  BAFTA в номінації «Найкращий сценарій»'),
 ('Гиппопотам', 'про амбітного колись поета, нині ж втратившого усе', 'роман', '9780091784126', 480, 'Стівен',
 'Фрай', 'fry@gmail.com', 64, '1957-08-24', 'отримав 6 місць у номінації «Топ живих ікон BBC», награжденно командорським класом грецького Ордена Фенікса'),
 ('Шум часу', 'не просто роман про музику, а музичний роман. історія викладена у трьох частинах, що зливаються, 
 як тризвучя.', 'роман', '9783839815311', 256, 'Джуліан', 'Барнс', 'barns@gmail.com', 75, '1946-01-19', 'Премія Сомерсета Моема, Букерівська премія');
 
 select * from книжка;
 
 select * from книжка where id = 9 or id = 2 or id = 6;
 
 select * from книжка where кількість_сторінок > 350;
 
 select * from книжка where вік_автора > 30;
 
 select * from книжка where нагороди_автора is null;
 
select * from книжка where email_автора = 'barns@gmail.com';

select * from книжка where isbn = '9780091784126';

select * from книжка where категорія = 'драма';

select * from книжка where кількість_сторінок > 200 and вік_автора > 25;

select * from книжка where категорія = 'комедія' or категорія = 'драма';

select * from книжка order by назва_книги;

select * from книжка order by email_автора;

select * from книжка order by кількість_сторінок desc;

select distinct категорія from книжка;

select distinct імя_автора from книжка;

select * from книжка where дата_публікації > '2000-01-01';

select * from книжка where дата_публікації < '2000-01-01';